In [2]:
import pandas as pd

seriesm

In [4]:
ser = pd.Series([1,2,3,4,5,6,7,8,9])

In [6]:
print(ser)
print(type(ser))

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64
<class 'pandas.core.series.Series'>

In [7]:
ser[3]=0
print(ser)

0    1
1    2
2    3
3    0
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [10]:
newSer=pd.Series([12,54,34,64,6,34,3,32,45],index=['adAM','EVE','HARqulis','may','johan','smit','list',
                                                  'roy','lucifer'])
print(newSer)

adAM        12
EVE         54
HARqulis    34
may         64
johan        6
smit        34
list         3
roy         32
lucifer     45
dtype: int64

In [13]:
adam= 'adAM'
print(newSer[adam])

12

In [14]:
print(newSer[2])

34

/tmp/ipykernel_24024/2473364998.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(newSer[2])

In [17]:
x=newSer.iloc[1]

In [18]:
print(x)

54

In [19]:
print(0 or 1)

1

In [20]:
print(0 and 1)

0

In [23]:
print(not(not(0 and 1)))

False

In [24]:
print(ser+newSer)

0          NaN
1          NaN
2          NaN
3          NaN
4          NaN
5          NaN
6          NaN
7          NaN
8          NaN
EVE        NaN
HARqulis   NaN
adAM       NaN
johan      NaN
list       NaN
lucifer    NaN
may        NaN
roy        NaN
smit       NaN
dtype: float64

In [25]:
h= ser+newSer

In [26]:
print(h)

0          NaN
1          NaN
2          NaN
3          NaN
4          NaN
5          NaN
6          NaN
7          NaN
8          NaN
EVE        NaN
HARqulis   NaN
adAM       NaN
johan      NaN
list       NaN
lucifer    NaN
may        NaN
roy        NaN
smit       NaN
dtype: float64

In [27]:
print(h[0])

nan

In [31]:
info ={
    "Name":['adam','bob','smith'],
    'age':[32,23,18],
    "gpa":[9.5,8.6,7.2],}

In [33]:
df =pd.DataFrame(info)
df

    Name  age  gpa
0   adam   32  9.5
1    bob   23  8.6
2  smith   18  7.2

In [37]:
df =pd.DataFrame([['lucfeir',2342],['bob',23],['eve',34]],columns =["Name","Age"])
print(df)

      Name   Age
0  lucfeir  2342
1      bob    23
2      eve    34

In [38]:
import numpy as np

np_arr = np.array([[1,2,3],[4,5,6]])

In [42]:
df =pd.DataFrame(np_arr,columns =['A','B','C'])

In [43]:
df

   A  B  C
0  1  2  3
1  4  5  6

In [4]:
df = pd.read_csv("data.csv")
print(df,type(df))
df

  Username; Identifier;One-time password;Recovery code;First name;Last name;Department;Location
0  booker12;9012;12se74;rb9012;Rachel;Booker;Sale...
1  grey07;2070;04ap67;lg2070;Laura;Grey;Depot;London
2  johnson81;4081;30no86;cj4081;Craig;Johnson;Dep...
3  jenkins46;9346;14ju73;mj9346;Mary;Jenkins;Engi...
4  smith79;5079;09ja61;js5079;Jamie;Smith;Enginee...                                            <class 'pandas.core.frame.DataFrame'>

  Username; Identifier;One-time password;Recovery code;First name;Last name;Department;Location
0  booker12;9012;12se74;rb9012;Rachel;Booker;Sale...
1  grey07;2070;04ap67;lg2070;Laura;Grey;Depot;London
2  johnson81;4081;30no86;cj4081;Craig;Johnson;Dep...
3  jenkins46;9346;14ju73;mj9346;Mary;Jenkins;Engi...
4  smith79;5079;09ja61;js5079;Jamie;Smith;Enginee...

In [5]:
print(df.head)

<bound method NDFrame.head of   Username; Identifier;One-time password;Recovery code;First name;Last name;Department;Location
0  booker12;9012;12se74;rb9012;Rachel;Booker;Sale...
1  grey07;2070;04ap67;lg2070;Laura;Grey;Depot;London
2  johnson81;4081;30no86;cj4081;Craig;Johnson;Dep...
3  jenkins46;9346;14ju73;mj9346;Mary;Jenkins;Engi...
4  smith79;5079;09ja61;js5079;Jamie;Smith;Enginee...                                           >